/**
  * @author  Liu heng
  * ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½2ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7RoboMasterï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½7
  */

#ifndef _KALMAN_H
#define _KALMAN_H
#include "Main/headfiles.h"
class Cv_Kalman_t{
public:
    Cv_Kalman_t();
private:
    std::unique_ptr<cv::KalmanFilter>KF;  // 装甲识别
    double Q;
    double R;
};

class Kalman_t {
public:
    Kalman_t(){};
    void KalmanInit(double T_Q,double T_R);
    double KalmanFilter(double dat);
private:
    double X_last; //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½0ï؟½2ï؟½1ï؟½7ï؟½0ï؟½9ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  X(k-|k-1)
    double X_mid;  //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½2ï؟½0ï؟½2ï؟½1ï؟½7ï؟½0ï؟½9ï؟½1ï؟½7ï؟½0ï؟½0ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  X(k|k-1)
    double X_now;  //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½2ï؟½0ï؟½2ï؟½1ï؟½7ï؟½0ï؟½9ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  X(k|k)
    double P_mid;  //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½2ï؟½0ï؟½2ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½0ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½ï؟½ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  P(k|k-1)
    double P_now;  //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½2ï؟½0ï؟½2ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½ï؟½ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  P(k|k)
    double P_last; //ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½0ï؟½2ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½0ï؟½5ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½ï؟½ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7  P(k-1|k-1)
    double kg;     //kalmanï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7
    double A;      //ï؟½0ï؟½3ï؟½0ï؟½1ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7ï؟½1ï؟½7
    double B;
    double Q;
    double R;
    double H;


};



#endif
